podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/WWDT_LPC13xx.svd.xml
<!--
Devices using this peripheral: 
      LPC13xx
-->
      <peripheral>
         <?sourceFile "WWDT_LPC13xx" ?>
         <name>WWDT</name>
         <description>Windowed WatchDog Timer</description>
         <groupName>WWDT</groupName>
         <headerStructName>WWDT</headerStructName>
         <baseAddress>0x40004000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x14</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MOD</name>
               <description>Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>WDEN</name>
                     <description>Watchdog enable bit. This bit is Set Only. Remark: Setting this bit to one also locks the watchdog clock source. Once the watchdog timer is enabled, the watchdog timer clock source cannot be changed. If the watchdog timer is needed in Deep-sleep mode, the watchdog clock source must be changed to watchdog oscillator before setting this bit to one</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>The watchdog timer is stopped</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RUN</name>
                           <description>The watchdog timer is running</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDRESET</name>
                     <description>Watchdog reset enable bit. This bit is Set Only</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>A watchdog timeout will not cause a chip reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERRUPT</name>
                           <description>A watchdog timeout will cause a chip reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDTOF</name>
                     <description>Watchdog time-out flag. Set when the watchdog timer times out, by a feed error, or by events associated with WDPROTECT, cleared by software. Causes a chip reset if WDRESET = 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDINT</name>
                     <description>Watchdog interrupt flag. Set when the timer reaches the value in WDWARNINT. Cleared by software</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDPROTECT</name>
                     <description>Watchdog update mode. This bit is Set Only</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ANYTIME</name>
                           <description>The watchdog reload value (WDTC) can be changed at any time</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MATCH</name>
                           <description>The watchdog reload value (WDTC) can be changed only after the counter is below the value of WDWARNINT and WDWINDOW. Note: this mode is intended for use only when WDRESET =1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TC</name>
               <description>Watchdog timer constant register. This register determines the time-out value</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>Count</name>
                     <description>Watchdog time-out interval</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEED</name>
               <description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in WDTC</description>
               <addressOffset>0x8</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>Feed</name>
                     <description>Feed value should be 0xAA followed by 0x55</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TV</name>
               <description>Watchdog timer value register. This register reads out the current value of the Watchdog timer</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>Count</name>
                     <description>Counter timer value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WARNINT</name>
               <description>Watchdog Warning Interrupt compare value</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>WARNINT</name>
                     <description>Watchdog warning interrupt compare value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINDOW</name>
               <description>Watchdog Window compare value</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0xFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>WINDOW</name>
                     <description>Watchdog window value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
